# Найдите сумму цифр трехзначного числа.

# Пример:

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

a = input('Введите любое трехзначное число: ') # Предложение пользователю ввести число в строковой форме.

print(int(a[0]) + int(a[1]) + int(a[2])) # Вывод на консоль суммы цифр числа.